Public Attributes | List of all members
ACAPI::MEP::DuctElbowPreferenceTable::Key Struct Reference
MEP Element Manager
The key that uniquely identifies a row in the DuctElbowPreferenceTable. More...
#include <MEPDuctElbowPreferenceTable.hpp>
 Public Attributes
 uint32_t  | referenceId
The referenceId of the row. The table only contains the referenceIds that are defined in the DuctReferenceSet.
 double  | angle
The angle of the row. The table only contains the angles that are defined in the DuctAngleSet. Needs to be between [1, 90] degrees.
Detailed Description
The key that uniquely identifies a row in the DuctElbowPreferenceTable.
Since
Archicad 29